## Agregación de Datos por categoría

In [1]:
import numpy as np
import pandas as pd

In [3]:
gender = ["Male", "Female"]
income = ["Poor", "Middle Class", "Rich"]

In [4]:
n = 500
gender_data = []
income_data = []

for i in range(500):
    gender_data.append(np.random.choice(gender))
    income_data.append(np.random.choice(income))

In [7]:
gender_data[:10]

['Male',
 'Male',
 'Male',
 'Female',
 'Male',
 'Female',
 'Male',
 'Female',
 'Female',
 'Male']

In [8]:
income_data[:10]

['Rich',
 'Rich',
 'Poor',
 'Poor',
 'Middle Class',
 'Poor',
 'Poor',
 'Poor',
 'Poor',
 'Middle Class']

In [9]:
height = 160 + 30 * np.random.randn(n)
weight = 65 + 25 * np.random.randn(n)
age = 30 + 12 * np.random.randn(n)
income = 18000 + 3500 * np.random.randn(n)

In [10]:
data = pd.DataFrame(
    {
        "Gender": gender_data,
        "Economic Status": income_data,
        "Height": height,
        "Age" : age,
        "Income" : income
    }
)

In [11]:
data.head()

   Gender Economic Status      Height        Age        Income
0    Male            Rich  181.406969  29.235417  18766.017123
1    Male            Rich  157.202930  35.326445  23419.799594
2    Male            Poor   88.381713  47.559280  17757.817898
3  Female            Poor  174.670916  43.722550  19911.545173
4    Male    Middle Class  145.540518  28.228207  17931.589155

## Agrupación de datos

In [14]:
grouped_gender = data.groupby("Gender")

In [15]:
grouped_gender.groups

{'Female': [3, 5, 7, 8, 10, 12, 13, 14, 16, 20, 23, 25, 27, 28, 31, 33, 37, 38, 39, 42, 45, 46, 48, 50, 59, 60, 63, 65, 67, 69, 70, 71, 72, 73, 75, 77, 78, 79, 80, 81, 83, 84, 86, 93, 95, 97, 104, 105, 106, 107, 111, 112, 114, 115, 118, 121, 122, 125, 127, 129, 130, 131, 132, 133, 134, 137, 138, 140, 141, 142, 146, 147, 149, 151, 152, 153, 155, 158, 160, 162, 163, 164, 165, 166, 167, 169, 172, 173, 174, 180, 182, 183, 184, 186, 187, 188, 190, 191, 192, 194, ...], 'Male': [0, 1, 2, 4, 6, 9, 11, 15, 17, 18, 19, 21, 22, 24, 26, 29, 30, 32, 34, 35, 36, 40, 41, 43, 44, 47, 49, 51, 52, 53, 54, 55, 56, 57, 58, 61, 62, 64, 66, 68, 74, 76, 82, 85, 87, 88, 89, 90, 91, 92, 94, 96, 98, 99, 100, 101, 102, 103, 108, 109, 110, 113, 116, 117, 119, 120, 123, 124, 126, 128, 135, 136, 139, 143, 144, 145, 148, 150, 154, 156, 157, 159, 161, 168, 170, 171, 175, 176, 177, 178, 179, 181, 185, 189, 193, 195, 198, 199, 200, 201, ...]}

In [16]:
for names, groups in grouped_gender:
    print(names)
    print(groups)

Female
     Gender Economic Status      Height        Age        Income
3    Female            Poor  174.670916  43.722550  19911.545173
5    Female            Poor   97.972630  30.546687  22780.998213
7    Female            Poor  134.597140  28.286719  16600.458694
8    Female            Poor  131.737449  31.737768  17493.672192
10   Female            Rich  169.997038  22.339751  15556.366925
..      ...             ...         ...        ...           ...
483  Female            Rich  181.902977  24.117662  17419.865415
484  Female            Poor  181.737343  39.554701  16248.935219
489  Female            Rich  156.669551  40.394243  16283.152173
495  Female    Middle Class  172.680990  31.190583  18163.972350
499  Female    Middle Class  188.837726  37.191933  21665.882798

[254 rows x 5 columns]
Male
    Gender Economic Status      Height        Age        Income
0     Male            Rich  181.406969  29.235417  18766.017123
1     Male            Rich  157.202930  35.326445  23419.799594
2     Male            Poor   88.381713  47.559280  17757.817898
4     Male    Middle Class  145.540518  28.228207  17931.589155
6     Male            Poor  158.903614  25.973414  19502.247730
..     ...             ...         ...        ...           ...
493   Male    Middle Class  146.318797  37.950546  20766.870333
494   Male            Poor  139.504844  26.675455  17146.693689
496   Male            Poor  159.435665  22.678731  19065.581650
497   Male            Poor  156.848820  19.750856  13916.231366
498   Male            Rich  137.922396  41.329210  17540.986123

[246 rows x 5 columns]

In [17]:
grouped_gender.get_group("Male")

    Gender Economic Status      Height        Age        Income
0     Male            Rich  181.406969  29.235417  18766.017123
1     Male            Rich  157.202930  35.326445  23419.799594
2     Male            Poor   88.381713  47.559280  17757.817898
4     Male    Middle Class  145.540518  28.228207  17931.589155
6     Male            Poor  158.903614  25.973414  19502.247730
..     ...             ...         ...        ...           ...
493   Male    Middle Class  146.318797  37.950546  20766.870333
494   Male            Poor  139.504844  26.675455  17146.693689
496   Male            Poor  159.435665  22.678731  19065.581650
497   Male            Poor  156.848820  19.750856  13916.231366
498   Male            Rich  137.922396  41.329210  17540.986123

[246 rows x 5 columns]

In [18]:
grouped_gender.get_group("Female")

     Gender Economic Status      Height        Age        Income
3    Female            Poor  174.670916  43.722550  19911.545173
5    Female            Poor   97.972630  30.546687  22780.998213
7    Female            Poor  134.597140  28.286719  16600.458694
8    Female            Poor  131.737449  31.737768  17493.672192
10   Female            Rich  169.997038  22.339751  15556.366925
..      ...             ...         ...        ...           ...
483  Female            Rich  181.902977  24.117662  17419.865415
484  Female            Poor  181.737343  39.554701  16248.935219
489  Female            Rich  156.669551  40.394243  16283.152173
495  Female    Middle Class  172.680990  31.190583  18163.972350
499  Female    Middle Class  188.837726  37.191933  21665.882798

[254 rows x 5 columns]

In [20]:
double_group = data.groupby(["Gender", "Economic Status"])

In [21]:
len(double_group)

6

In [22]:
for names, groups in double_group:
    print(names)
    print(groups)

('Female', 'Middle Class')
     Gender Economic Status      Height        Age        Income
27   Female    Middle Class  162.551658  37.936574  15387.256496
28   Female    Middle Class  154.993600  40.196944  18446.595937
31   Female    Middle Class  128.883783  41.519161  18189.055289
33   Female    Middle Class  167.938628  37.567553  18047.416221
39   Female    Middle Class  156.294557  13.603563  21708.032395
..      ...             ...         ...        ...           ...
462  Female    Middle Class  168.689342  34.264264  16246.286270
472  Female    Middle Class  157.242072  42.716713  16808.614969
475  Female    Middle Class  164.162293  20.563155  24575.404194
495  Female    Middle Class  172.680990  31.190583  18163.972350
499  Female    Middle Class  188.837726  37.191933  21665.882798

[76 rows x 5 columns]
('Female', 'Poor')
     Gender Economic Status      Height        Age        Income
3    Female            Poor  174.670916  43.722550  19911.545173
5    Female            Poor   97.972630  30.546687  22780.998213
7    Female            Poor  134.597140  28.286719  16600.458694
8    Female            Poor  131.737449  31.737768  17493.672192
12   Female            Poor  115.250242  57.972456  17317.985666
..      ...             ...         ...        ...           ...
445  Female            Poor  201.332025  48.641302  16209.090659
447  Female            Poor   87.179449   0.726775  19846.375181
454  Female            Poor  186.976683  12.355049  12815.160601
478  Female            Poor  149.656344  35.107960  19659.936353
484  Female            Poor  181.737343  39.554701  16248.935219

[78 rows x 5 columns]
('Female', 'Rich')
     Gender Economic Status      Height        Age        Income
10   Female            Rich  169.997038  22.339751  15556.366925
13   Female            Rich  175.208769   7.618862  13505.418302
16   Female            Rich  183.967095  29.790302  24063.679673
23   Female            Rich  195.140310  35.980470  21334.909141
25   Female            Rich  181.370155  49.251125  20472.334318
..      ...             ...         ...        ...           ...
468  Female            Rich  135.645069  30.111843  13703.973888
470  Female            Rich  172.064799  36.100822  28454.633411
481  Female            Rich  129.811915  41.371405  17577.146526
483  Female            Rich  181.902977  24.117662  17419.865415
489  Female            Rich  156.669551  40.394243  16283.152173

[100 rows x 5 columns]
('Male', 'Middle Class')
    Gender Economic Status      Height        Age        Income
4     Male    Middle Class  145.540518  28.228207  17931.589155
9     Male    Middle Class  190.605347  21.309983  18358.206370
15    Male    Middle Class  173.222472  53.332331  14817.221188
19    Male    Middle Class  171.104315  25.235389  26636.775490
24    Male    Middle Class  177.995932  58.615313  25475.843844
..     ...             ...         ...        ...           ...
474   Male    Middle Class  193.866043  19.409617  15363.405844
477   Male    Middle Class  183.420115  36.773396  12651.391465
480   Male    Middle Class  142.751072  20.563560  14312.720585
492   Male    Middle Class  219.354931  17.641593  18597.984243
493   Male    Middle Class  146.318797  37.950546  20766.870333

[76 rows x 5 columns]
('Male', 'Poor')
    Gender Economic Status      Height        Age        Income
2     Male            Poor   88.381713  47.559280  17757.817898
6     Male            Poor  158.903614  25.973414  19502.247730
18    Male            Poor  124.913111  24.668982  17231.425865
21    Male            Poor  199.467356  32.899241  21829.336747
26    Male            Poor  124.753991  17.700941  20271.134689
..     ...             ...         ...        ...           ...
486   Male            Poor  193.252607  19.037322  17951.274440
487   Male            Poor  161.041553  35.080368  16656.738858
494   Male            Poor  139.504844  26.675455  17146.693689
496   Male            Poor  159.435665  22.678731  19065.581650
497   Male            Poor  156.848820  19.750856  13916.231366

[92 rows x 5 columns]
('Male', 'Rich')
    Gender Economic Status      Height        Age        Income
0     Male            Rich  181.406969  29.235417  18766.017123
1     Male            Rich  157.202930  35.326445  23419.799594
11    Male            Rich  134.428140  20.031187  22205.315903
17    Male            Rich  214.356716  55.539826  10389.963094
22    Male            Rich  179.398277  20.164747  20264.373673
..     ...             ...         ...        ...           ...
485   Male            Rich  114.274955  18.617022  21061.921675
488   Male            Rich  171.505258  32.114177  24401.104243
490   Male            Rich  172.402528  32.819870  14629.623392
491   Male            Rich  182.715658  17.783197  13744.258530
498   Male            Rich  137.922396  41.329210  17540.986123

[78 rows x 5 columns]